# -*- coding: utf-8 -*-

from gettext import gettext as _

NAME = _('Paysandú')

STATES = [
    (_('Salto'), 254, 417, 156, 0),
    (_('Paysandú'), 253, 347, 466, 0),
    (_('Río Negro'), 252, 294, 767, 0),
    (_('Durazno'), 251, 624, 862, 0),
    (_('Tacuarembó'), 250, 737, 577, -90),
    (_('Argentina'), 249, 33, 150, 90)
]

CITIES = [
    (_('Paysandú'), 75, 590, 1, 45, -5),
    (_('Chapicuy'), 140, 289, 2, 20, -14),
    (_('Bella Vista'), 203, 298, 2, 0, 14),
    (_('Pueblo Gallinal'), 320, 359, 2, 0, -14),
    (_('Cerro Chato'), 296, 368, 2, -20, 14),
    (_('Quebracho'), 140, 411, 2, 0, -14),
    (_('Soto'), 266, 406, 2, 0, 12),
    (_('El Eucalipto'), 376, 381, 2, 15, -14),
    (_('Tambores'), 742, 385, 2, -45, 0),
    (_('Guarapirí'), 393, 392, 2, 0, 12),
    (_('Queguayar'), 160, 445, 2, 0, -14),
    (_('Lorenzo Geyres'), 150, 466, 2, 0, 12),
    (_('Cuchilla del Fuego'), 472, 468, 2, 0, -14),
    (_('Piedra Sola'), 720, 465, 2, -50, 0),
    (_('Constancia'), 103, 517, 2, 0, -14),
    (_('Curapí'), 77, 544, 2, 22, -12),
    (_('Esperanza'), 149, 569, 2, 0, -12),
    (_('Porvenir'), 149, 601, 2, 0, 12),
    (_('Piedras Coloradas'), 258, 582, 2, 0, -14),
    (_('Orgoroso'), 291, 595, 2, 42, 0),
    (_('Arroyo Negro'), 302, 617, 2, -60, 0),
    (_('La Tentación'), 202, 643, 2, 0, 12),
    (_('Guichón'), 397, 585, 2, -5, -14),
    (_('Beisso'), 460, 569, 2, 5, -14),
    (_('Tres Arboles'), 575, 596, 2, -20, -14),
    (_('Tiatucurá'), 632, 577, 2, -10, -14)
]

RIVERS = [
    (_('Río Uruguay'), 254, 10, 450, 90),
    (_('Río Daymán'), 253, 291, 268, -25),
    (_('Río Queguay Gr.'), 252, 112, 502, 0),
    (_('Río Queguay Ch.'), 251, 521, 392, 35),
    (_('Río Negro'), 250, 676, 818, 0),
    (_('A. Guaviyú'), 247, 132, 379, 0),
    (_('A. Quebracho Gr.'), 245, 131, 428, 25),
    (_('A. Araujo'), 244, 195, 443, 45),
    (_('A. de Soto'), 243, 247, 452, 45),
    (_('A. Buricayupí'), 242, 293, 449, 60),
    (_('A. Carumbé'), 241, 265, 308, -55),
    (_('A. San Fsco. Gr.'), 238, 144, 580, -5),
    (_('A. Negro'), 236, 118, 692, -30),
    (_('A. Rabón'), 235, 139, 615, 30),
    (_('A. Valdés'), 234, 190, 637, 10),
    (_('A. Celestina'), 233, 183, 655, 0),
    (_('A. Bacacuá Gr.'), 231, 250, 550, -45),
    (_('A. Ñacurutú Gr.'), 228, 337, 553, -55),
    (_('A. de la Capilla'), 227, 273, 540, -45),
    (_('A. Guayabos'), 226, 359, 556, -60),
    (_('A. Santa Ana'), 225, 418, 544, -45),
    (_('A. de los Corrales'), 222, 578, 428, 60),
    (_('A. de los Molles'), 221, 501, 490, 60),
    (_('A. Zapatero'), 218, 674, 490, 20),
    (_('A. Juan Tomás'), 211, 587, 598, -30),
    (_('A. Salsipuedes Gr.'), 210, 656, 632, 74),
    (_('A. Molles Gr.'), 206, 433, 418, 65),
    (_('A. Molles Ch.'), 205, 458, 418, 65),
    (_('A. Gualeguay'), 204, 344, 445, 55),
    (_('A. Guarapirú'), 203, 378, 423, 75)
]

CUCHILLAS = [
    (_('Cuchilla del Queguay'), 254, 377, 373, 0),
    (_('Cuchilla de Haedo'), 253, 521, 593, 0)
]

HILLS = [
    (_('Co. de los Difuntos'), 169, 482, 5, 0, 14),
    (_('Co. Buricayupí'), 264, 454, 5, 0, 14),
    (_('Co. de la Glorieta'), 450, 387, 5, 0, 14),
    (_('Co. del Vigía'), 581, 395, 5, 0, 14),
    (_('Co. Campana'), 644, 434, 5, 0, 14),
    (_('Co. Arbolito'), 736, 386, 5, -60, -2),
    (_('Co. del Toro'), 499, 581, 5, 0, -14),
    (_('Co. Palmera Sola'), 437, 589, 5, 0, 16),
    (_('Meseta de Artigas'), 117, 273, 5, 68, 14)
]

ROUTES = [
    (_('Ruta 3'), 253, 99, 635, -45),
    (_('Ruta 26'), 254, 298, 451, 0),
    (_('Ruta 4'), 252, 380, 495, -50),
    (_('Ruta 90'), 251, 250, 592, -5),
    (_('Ruta 24'), 250, 94, 685, 90)
]
