# -*- coding: utf-8 -*-

from gettext import gettext as _

NAME = _('Maldonado')

STATES = [
    (_('Lavalleja'), 254, 232, 230, 0),
    (_('Canelones'), 253, 20, 611, 90),
    (_('Maldonado'), 252, 385, 603, 0),
    (_('Rocha'), 251, 736, 476, -90),
    (_('Florida'), 250, 39, 57, 45)
]

CITIES = [
    (_('Maldonado'), 389, 795, 1, 0, -15),
    (_('Los Talas'), 721, 160, 2, -30, -14),
    (_('Aiguá'), 531, 260, 2, 27, 0),
    (_('José Ignacio'), 609, 759, 2, 2, 16),
    (_('San Carlos'), 412, 711, 2, 0, -14),
    (_('Punta del Este'), 402, 852, 2, 2, 17),
    (_('Pan de Azúcar'), 216, 712, 2, 0, -14),
    (_('Piriápolis'), 188, 775, 2, 30, -14),
    (_('Punta Ballena'), 338, 806, 2, -10, 15),
    (_('Garzón'), 672, 568, 2, -35, 0),
    (_('Las Flores'), 154, 730, 2, -40, 14),
    (_('La Barra'), 465, 811, 2, 40, 14)
]

RIVERS = [
    (_('Océano Atlántico'), 230, 634, 832, 0),
    (_('Río de la Plata'), 254, 200, 832, 0),
    (_('A. Garzón'), 253, 665, 600, 90),
    (_('A. de Rocha'), 252, 644, 373, -15),
    (_('A. Valdivia'), 251, 652, 310, 20),
    (_('A. del Alferez'), 250, 705, 182, 85),
    (_('A. del Aiguá'), 249, 508, 254, 70),
    (_('A. Sarandí'), 248, 643, 185, 80),
    (_('A. del León'), 247, 563, 239, 90),
    (_('A. Solís Gr.'), 246, 92, 668, -45),
    (_('A. Coronilla'), 245, 527, 381, -30),
    (_('A. Sauce'), 244, 90, 568, 0),
    (_('A. Pan de Azúcar'), 243, 180, 648, 90),
    (_('A. del Sauce'), 242, 261, 657, -45),
    (_('A. Mataojo'), 241, 318, 582, -45),
    (_('A. de las Cañas'), 240, 515, 499, 70),
    (_('A. de los Caracoles'), 239, 455, 480, 75),
    (_('A. de los Carpés'), 238, 375, 524, -35),
    (_('A. San Carlos'), 237, 459, 656, 75),
    (_('A. Maldonado'), 236, 405, 773, -65),
    (_('A. J. Ignacio'), 235, 578, 620, 90),
    (_('Lag. Garzón'), 234, 654, 699, 0),
    (_('Lag. J. Ignacio'), 233, 562, 742, 0),
    (_('Lag. del Sauce'), 232, 328, 751, 0)
]

CUCHILLAS = [
    (_('Sierra de las Cañas'), 254, 519, 554, 65),
    (_('Sierra de los Caracoles'), 253, 379, 571, -70),
    (_('Sierra de las Ánimas'), 252, 156, 650, 90),
    (_('Sierra de la Ballena'), 251, 369, 733, 72),
    (_('Sierra de Carapé'), 250, 480, 397, 15)
]

HILLS = [
    (_('Co. del Toro'), 198, 777, 5, 55, 0),
    (_('Co. San Antonio'), 190, 786, 5, -76, 0),
    (_('Co. Pan de Azúcar'), 193, 752, 5, 0, -14),
    (_('Co. Catedral'), 588, 384, 5, 20, 14)
]

ROUTES = [
    (_('Ruta 9'), 250, 527, 685, 10),
    (_('Ruta IB'), 249, 47, 702, 0),
    (_('Ruta 60'), 248, 197, 578, 90),
    (_('Ruta 37'), 247, 181, 744, 60),
    (_('Ruta 12'), 246, 341, 606, -70),
    (_('Ruta 93'), 245, 290, 772, 0),
    (_('Ruta 39'), 244, 455, 542, 65),
    (_('Ruta 13'), 243, 626, 193, 30),
    (_('Ruta 109'), 242, 592, 306, -60),
    (_('Ruta 10'), 241, 494, 783, 25)
]
