# -*- coding: utf-8 -*-

from gettext import gettext as _

NAME = _('Rivera')

STATES = [
    (_('Rivera'), 254, 318, 367, 0),
    (_('Artigas'), 253, 50, 164, 0),
    (_('Salto'), 252, 31, 287, 90),
    (_('Tacuarembó'), 251, 213, 713, 0),
    (_('Cerro Largo'), 250, 740, 765, -90),
    (_('Brasil'), 249, 576, 174, 0)
]

CITIES = [
    (_('Rivera'), 290, 174, 1, 5, 17),
    (_('Curticeiras'), 287, 207, 2, 0, 12),
    (_('Tranqueras'), 203, 320, 2, 0, -14),
    (_('La Calera'), 355, 412, 2, 0, -14),
    (_('Lapuente'), 496, 420, 2, 0, -14),
    (_('Cerrillada'), 572, 431, 2, -25, 12),
    (_('Cerro Pelado'), 455, 461, 2, 0, 12),
    (_('Minas de Corrales'), 324, 508, 2, 0, 12),
    (_('Hospital'), 683, 545, 2, 0, -14),
    (_('Las Flores'), 465, 607, 2, 0, -14),
    (_('Vichadero'), 652, 613, 2, 0, -14)
]

RIVERS = [
    (_('Río Tacuarembó'), 254, 204, 410, 90),
    (_('Río Negro'), 236, 738, 677, 64),
    (_('A. Laureles'), 253, 139, 320, -45),
    (_('A. Tigre'), 252, 176, 285, -45),
    (_('A. Médanos'), 251, 254, 416, -50),
    (_('A. Mangueras'), 250, 377, 383, 26),
    (_('A. del Ataque'), 249, 365, 344, 30),
    (_('A. Batoví Dorado'), 248, 365, 281, 60),
    (_('A. Cuñapirú'), 247, 298, 346, 90),
    (_('A. Corrales'), 246, 357, 474, 50),
    (_('A. J. Amarillas'), 244, 441, 463, -30),
    (_('A. Coronilla'), 243, 396, 502, -30),
    (_('A. Carpintería'), 241, 431, 558, 60),
    (_('A. Yaguarí'), 240, 532, 448, -80),
    (_('A. Amarillo'), 239, 501, 546, -75),
    (_('A. Cerro'), 237, 554, 575, -25),
    (_('A. del Hospital'), 235, 680, 547, -35),
    (_('A. San Luis'), 234, 722, 506, -55),
    (_('A. Ceibal'), 233, 715, 629, -65),
    (_('A. Zanja Honda'), 231, 675, 662, -20),
    (_('A. Blanco'), 229, 597, 570, -10),
    (_('A. Molles'), 228, 588, 525, 10),
    (_('A. Caraguatá'), 227, 599, 638, 60),
    (_('A. Cerro Chato'), 225, 537, 615, 20)
]

CUCHILLAS = [
    (_('Cuchilla de Cuñapirú'), 254, 279, 322, 80),
    (_('Cuchilla del Yaguarí'), 253, 408, 531, 30),
    (_('Cuchilla Negra'), 250, 205, 222, 40),
    (_('Cuchilla de Haedo'), 249, 58, 348, 55),
    (_('Cuchilla de Santa Ana'), 248, 407, 309, -50)
]

HILLS = [
    (_('Co. del Hospital'), 705, 563, 5, -30, -14),
    (_('Co. Bonito'), 674, 574, 5, 0, 14),
    (_('Co. de la Cruz'), 437, 538, 5, 30, 14),
    (_('Co. del Medio'), 255, 521, 5, 50, -14),
    (_('Co. de los Peludos'), 132, 302, 5, 35, 14)
]

ROUTES = [
    (_('Route %s') % 5, 250, 271, 278, 75),
    (_('Route %s') % 30, 249, 166, 322, -15),
    (_('Route %s') % 29, 248, 277, 474, -15),
    (_('Route %s') % 27, 247, 445, 414, -40),
    (_('Route %s') % 6, 246, 645, 664, 75),
    (_('Route %s') % 28, 245, 366, 563, -60),
    (_('Route %s') % 44, 244, 587, 701, -60)
]

