# -*- coding: utf-8 -*-

from gettext import gettext as _

NAME = _('Artigas')

STATES = [
    (_('Artigas'), 254, 324, 370, 0),
    (_('Salto'), 253, 288, 675, 0),
    (_('Paysandú'), 252, 136, 874, 0),
    (_('Tacuarembó'), 251, 683, 790, -90),
    (_('Rivera'), 250, 737, 613, 0),
    (_('Argentina'), 249, 103, 103, 45),
    (_('Brasil'), 248, 625, 150, 0)	
]

CITIES = [
    (_('Artigas'), 523, 290, 1, -40, 0),
    (_('Bella Unión'), 126, 232, 2, 57, -10),
    (_('Tomás Gomensoro'), 179, 296, 2, 40, -14),
    (_('Colonia Palma'), 91, 355, 2, 20, 12),
    (_('Paso Farías'), 269, 312, 2, 0, 12),
    (_('Baltasar Brum'), 216, 417, 2, -20, -14),
    (_('Bernabé Rivera'), 353, 242, 2, 0, -14),
    (_('Diego Lamas'), 312, 427, 2, 0, -14),
    (_('Paso Campamento'), 415, 454, 2, 0, -14),
    (_('Sequeira'), 376, 529, 2, 0, -14),
    (_('Catalán'), 558, 425, 2, 0, -14)
]

RIVERS = [
    (_('Río Uruguay'), 254, 23, 442, 90),
    (_('Río Cuareim'), 253, 346, 150, 0),
    (_('Río Arapey'), 252, 338, 566, 0),
    (_('A. Itacumbú'), 251, 176, 313, -60),
    (_('A. Ñaquiña'), 250, 120, 326, -30),
    (_('A. Mandiyú'), 249, 100, 341, -30),
    (_('A. Guaviyú'), 248, 107, 380, 0),
    (_('A. Palma Sola Gr.'), 247, 172, 414, 30),
    (_('A. Sarandí'), 245, 122, 410, 32),
    (_('A. Yucutuya'), 244, 258, 317, -60),
    (_('A. Cuaro Gr.'), 242, 321, 304, -50),
    (_('A. Cuaro Ch.'), 241, 431, 382, -40),
    (_('A. Pelado'), 240, 360, 306, -50),
    (_('A. Tres Cruces Gr.'), 239, 419, 322, -45),
    (_('A. Catalán Gr.'), 237, 590, 396, -80),
    (_('A. Catalán Ch.'), 236, 565, 468, -90),
    (_('A. Catalancito'), 234, 540, 382, 60),
    (_('A. Maneco'), 232, 699, 536, -90),
    (_('A. de la Invernada'), 231, 736, 498, -50),
    (_('A. Sepultura'), 229, 653, 448, 90),
    (_('A. Yacuy'), 224, 120, 472, -35),
    (_('A. Ceballos'), 222, 241, 463, 54),
    (_('A. de las Cañas'), 221, 360, 497, 20),
    (_('A. Patitos'), 220, 281, 468, 90),
    (_('A. Sequeira'), 217, 414, 518, 48),
    (_('A. Espinillo'), 216, 452, 520, 60),
    (_('A. Sarandí Gr.'), 215, 463, 475, -20)
]

CUCHILLAS = [
    (_('Cuchilla Yacaré Cururú'), 254, 387, 256, -24),
    (_('Cuchilla de Belén'), 253, 406, 473, -20)
]

HILLS = [
    (_('Co. Chato'), 402, 224, 5, 0, -14),
    (_('Tres Cerros de Catalán'), 522, 400, 5, 0, 14),
    (_('Co. Pintado'), 544, 320, 5, -20, 14)
]

ROUTES = [
    (_('Ruta 3'), 250, 98, 316, 75),
    (_('Ruta 4'), 249, 425, 398, 50),
    (_('Ruta 30'), 248, 378, 291, 0)
]
