# -*- coding: utf-8 -*-

from gettext import gettext as _

NAME = _('Río Negro')

STATES = [
    (_('Paysandú'), 254, 453, 137, 0),
    (_('Río Negro'), 253, 513, 400, 0),
    (_('Soriano'), 252, 256, 759, 0),
    (_('Durazno'), 251, 697, 566, 0),
    (_('Flores'), 250, 615, 756, 0),
    (_('Tacuarembó'), 249, 769, 355, -90),
    (_('Argentina'), 248, 57, 281, 90)
]

CITIES = [
    (_('Fray Bentos'), 79, 596, 1, 32, 14),
    (_('Merinos'), 611, 250, 2, 0, 12),
    (_('Algorta'), 421, 273, 2, 0, 12),
    (_('P. de los Mellizos'), 513, 307, 2, 30, -12),
    (_('Sarandí de Navarro'), 626, 317, 2, 0, 12),
    (_('Paso de la Cruz'), 388, 322, 2, 0, 12),
    (_('San Javier'), 141, 381, 2, 40, -14),
    (_('Young'), 326, 395, 2, 0, -14),
    (_('Tres Quintas'), 205, 417, 2, 0, -14),
    (_('Bellaco'), 232, 426, 2, 0, 12),
    (_('Grecco'), 558, 443, 2, 0, 12),
    (_('Nuevo Berlín'), 174, 525, 2, 54, 0)
]

RIVERS = [
    (_('Río Uruguay'), 254, 114, 433, -80),
    (_('Río Negro'), 253, 320, 572, 0),
    (_('A. Grande'), 252, 409, 474, 45),
    (_('A. de las Flores'), 251, 468, 507, 15),
    (_('A. Averías Gr.'), 250, 593, 315, 50),
    (_('A. Averías Ch.'), 249, 498, 408, 5),
    (_('A. Ñandubay'), 248, 467, 470, 30),
    (_('A. Don Esteban'), 247, 371, 414, 60),
    (_('A. Santa María'), 246, 359, 387, 60),
    (_('A. Negro'), 245, 236, 322, 0),
    (_('A. Bellaco'), 244, 167, 359, -45),
    (_('A. Gutiérrez'), 243, 322, 359, -10),
    (_('A. Coladeras'), 242, 224, 486, -80),
    (_('A. Sánchez'), 241, 262, 480, 80),
    (_('A. Salsipuedes Gr.'), 237, 747, 365, 70),
    (_('A. Tres Árboles'), 236, 671, 315, 90),
    (_('A. Rolón'), 235, 629, 370, -45),
    (_('A. Molles'), 234, 599, 461, -50	)
]

CUCHILLAS = [
    (_('Cuchilla de Haedo'), 254, 322, 367, 40),
    (_('Cuchilla de Navarro'), 253, 576, 450, 45)
]

HILLS = [
    (_('Co. Pelado'), 435, 519, 5, 0, -14),
    (_('Co. del Quebracho'), 522, 394, 5, 0, -14)
]

ROUTES = [
    (_('Ruta 2'), 250, 120, 622, 0),
    (_('Ruta 24'), 249, 208, 480, 75),
    (_('Ruta 3'), 248, 380, 447, -45),
    (_('Ruta 20'), 247, 475, 458, 20),
    (_('Ruta 25'), 246, 290, 420, 0),
    (_('Ruta 4'), 245, 621, 437, -45)
]
